[
  {
    "id": 1,
    "company": "Wayfair",
    "position": "Lead Software Engineer (L3)",
    "location": "Bengaluru, India",
    "startDate": "2024-05",
    "endDate": null,
    "description": "Contributing to the Product Decoupling team, focusing on platform-wide architecture initiatives and onboarding support.",
    "achievements": [
      "Led tech transformation initiatives for Global Supplier Tech, including strategic SQL query migration.",
      "Enabled 80% target completion for Q2 by driving cross-team coordination and mentoring.",
      "Facilitated smooth onboarding of new engineers, enhancing productivity and team agility."
    ],
    "technologies": [
      "Java",
      "SpringBoot",
      "PostgreSQL",
      "MsSql",
      "GenAI",
      "LangChain",
      "BigTable",
      "Microservices",
      "GCP"
    ],
    "projects": [],
    "isCurrent": true,
    "order": 0
  },
  {
    "id": 2,
    "company": "Meesho",
    "position": "Software Development Engineer III",
    "location": "Bengaluru, India",
    "startDate": "2022-07",
    "endDate": "2024-05",
    "description": "Owned critical backend services and delivered cost-effective, scalable solutions impacting millions of users.",
    "achievements": [
      "Reduced infrastructure cost by ~50% by integrating local caching, Redis pub-sub, and optimizing data flows.",
      "Led development and maintenance of 5 services, including 2 P0 services with 50K–70K RPS.",
      "Implemented gRPC-based client to optimize service communication latency and cost.",
      "Collaborated across teams to improve DB uptime and reduce cost by 25%.",
      "Actively mentored engineers and participated in hiring efforts."
    ],
    "technologies": [
      "Java",
      "gRPC",
      "Redis",
      "Kafka",
      "SpringBoot",
      "AWS",
      "Kubernetes",
      "Grafana",
      "Telegraf"
    ],
    "projects": [],
    "isCurrent": false,
    "order": 1
  },
  {
    "id": 3,
    "company": "Meesho",
    "position": "Software Development Engineer II",
    "location": "Bengaluru, India",
    "startDate": "2021-06",
    "endDate": "2022-06",
    "description": "Led multiple product initiatives in the supplier acquisition team, focusing on scale, security, and developer experience.",
    "achievements": [
      "Drove 4X supplier community growth through well-architected systems like referral, supplier data platform, and agency panel.",
      "Took full ownership of 5 key services, including high-traffic services impacting core business.",
      "Led monolith-to-microservices migration efforts to enhance scalability and modularity.",
      "Improved API security by implementing rate limiting and resilient authentication flows.",
      "Mentored junior engineers and supported service onboarding across teams."
    ],
    "technologies": [
      "Java",
      "SpringBoot",
      "MySQL",
      "Kafka",
      "Redis",
      "Prometheus",
      "Grafana",
      "NodeJs"
    ],
    "projects": [],
    "isCurrent": false,
    "order": 2
  },
  {
    "id": 4,
    "company": "imimobile (part of Cisco)",
    "position": "Software Engineer",
    "location": "Hyderabad, India",
    "startDate": "2019-12",
    "endDate": "2021-06",
    "description": "Built scalable backend systems for high-volume messaging platforms and internal tooling.",
    "achievements": [
      "Re-architected group de-duplication for large messaging systems, reducing group creation time by 10x.",
      "Built robust backend systems using RabbitMQ, PHP, and Bash scripting.",
      "Collaborated closely with cross-functional teams to deliver reliable and flexible modules."
    ],
    "technologies": [
      "PHP",
      "RabbitMQ",
      "MySQL",
      "Docker",
      "Bash",
      "OOD"
    ],
    "projects": [],
    "isCurrent": false,
    "order": 3
  },
  {
    "id": 5,
    "company": "HighRadius",
    "position": "Associate Software Engineer",
    "location": "Hyderabad, India",
    "startDate": "2018-05",
    "endDate": "2019-06",
    "description": "Worked on backend automation tools for enterprise clients, focusing on efficiency and reliability.",
    "achievements": [
      "Built an EDI parser from scratch to streamline financial data integration.",
      "Developed automated agents for Sales Invoice and Bank Upload operations using multithreading and Hibernate.",
      "Created internal git tooling that saved 30+ minutes daily for developers across the team."
    ],
    "technologies": [
      "Java",
      "Hibernate",
      "Multithreading (ForkJoinPool)",
      "MySQL",
      "Shell Scripting"
    ],
    "projects": [],
    "isCurrent": false,
    "order": 4
  }
]