[
  {
    "id": 1,
    "name": "Sarah Johnson",
    "role": "Senior Engineering Manager",
    "company": "TechCorp",
    "content": "Nitesh is an exceptional backend engineer who consistently delivers high-quality, scalable solutions. His expertise in microservices architecture and GenAI has been invaluable to our team.",
    "rating": 5,
    "avatar": "SJ",
    "isDeleted": true
  },
  {
    "id": 2,
    "name": "Michael Chen",
    "role": "CTO",
    "company": "StartupXYZ",
    "content": "Working with Nitesh was a game-changer for our platform. His deep understanding of distributed systems and ability to lead technical initiatives made him an invaluable team member.",
    "rating": 5,
    "avatar": "MC",
    "isDeleted": true
  },
  {
    "id": 3,
    "name": "Emily Rodriguez",
    "role": "Product Manager",
    "company": "InnovateTech",
    "content": "Nitesh's technical leadership and problem-solving skills are outstanding. He has a unique ability to translate complex technical concepts into actionable solutions that drive business value.",
    "rating": 5,
    "avatar": "ER",
    "isDeleted": true
  },
  {
    "id": 4,
    "name": "David Kim",
    "role": "Lead Developer",
    "company": "ScaleUp Inc",
    "content": "Nitesh's contributions to our microservices architecture were transformative. His attention to detail and commitment to best practices elevated our entire engineering team.",
    "rating": 5,
    "avatar": "DK",
    "isDeleted": true
  },
  {
    "id": 5,
    "name": "Lisa Wang",
    "role": "Engineering Director",
    "company": "CloudTech Solutions",
    "content": "Nitesh's expertise in GenAI and his ability to architect scalable solutions has been instrumental in our platform's success. He's a true technical leader.",
    "rating": 5,
    "avatar": "LW",
    "isDeleted": true
  },
  {
    "id": 6,
    "name": "Alex Thompson",
    "role": "Senior Backend Engineer",
    "company": "DataFlow Systems",
    "content": "Collaborating with Nitesh on our distributed systems was an incredible experience. His knowledge of microservices and performance optimization is exceptional.",
    "rating": 5,
    "avatar": "AT",
    "isDeleted": true
  }
] 